#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/3ll34ndr0/gh-flugel-it/runs/run-v1rYZiApXee8zBSC

Waiting for the plan to start...

Terraform v0.13.4
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_s3_bucket.flugel-it-bucket-3ll34ndr0: Refreshing state... [id=random-tests-3ll34ndr0]
data.aws_s3_bucket_object.test1: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_access_point.example will be created
  + resource "aws_s3_access_point" "example" {
      + account_id               = (known after apply)
      + arn                      = (known after apply)
      + bucket                   = "random-tests-3ll34ndr0"
      + domain_name              = (known after apply)
      + has_public_access_policy = (known after apply)
      + id                       = (known after apply)
      + name                     = "example"
      + network_origin           = (known after apply)
    }

  # aws_s3_bucket_object.test1 will be created
  + resource "aws_s3_bucket_object" "test1" {
      + acl                    = "private"
      + bucket                 = "random-tests-3ll34ndr0"
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "test1.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "test1.txt"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.test2 will be created
  + resource "aws_s3_bucket_object" "test2" {
      + acl                    = "private"
      + bucket                 = "random-tests-3ll34ndr0"
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "test2.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "test2.txt"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.test1 will be created
  + resource "local_file" "test1" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "test1.txt"
      + id                   = (known after apply)
    }

  # local_file.test2 will be created
  + resource "local_file" "test2" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "test2.txt"
      + id                   = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + test1_content = "Wed Oct 21 09:55:27 -03 2020"
```

</details>

*Pusher: @3ll34ndr0, Action: `pull_request`*